In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
file_folder = '~/Data/Kaggle/Titanic/'

In [3]:
test_file = file_folder + 'test.csv'

In [4]:
df = pd.read_csv(test_file)

In [5]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
df.shape

(418, 11)

### Check for Null values

In [7]:
df['Pclass'].value_counts()

3    218
1    107
2     93
Name: Pclass, dtype: int64

In [8]:
df['Pclass'].isna().sum()

0

In [9]:
df['Sex'].value_counts()

male      266
female    152
Name: Sex, dtype: int64

In [10]:
df['Sex'].isna().sum()

0

In [11]:
df['Age'].isna().sum()

86

In [12]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [13]:
df['SibSp'].isna().sum()

0

In [14]:
df['SibSp'].value_counts()

0    283
1    110
2     14
4      4
3      4
8      2
5      1
Name: SibSp, dtype: int64

In [15]:
df['Parch'].isna().sum()

0

In [16]:
df['Parch'].value_counts()

0    324
1     52
2     33
3      3
9      2
4      2
6      1
5      1
Name: Parch, dtype: int64

In [17]:
df['FamilySize'] = df['SibSp'] + df['Parch']

In [18]:
df['Fare'].isna().sum()

1

In [19]:
df['Fare'].describe()

count    417.000000
mean      35.627188
std       55.907576
min        0.000000
25%        7.895800
50%       14.454200
75%       31.500000
max      512.329200
Name: Fare, dtype: float64

In [20]:
df['Fare'] = df['Fare'].fillna(35.627188)

In [21]:
df['Cabin'].isna().sum()

327

In [22]:
df['Cabin'].value_counts()

B57 B59 B63 B66    3
C23 C25 C27        2
C78                2
B45                2
E34                2
                  ..
C97                1
B52 B54 B56        1
C51                1
C39                1
C105               1
Name: Cabin, Length: 76, dtype: int64

In [23]:
df['Embarked'].isna().sum()

0

In [24]:
df['Embarked'].value_counts()

S    270
C    102
Q     46
Name: Embarked, dtype: int64

In [25]:
df['Embarked'] = df['Embarked'].fillna('S')

### Encode categorical columns

In [26]:
cat_cols = ['Pclass', 'Sex', 'Embarked']

In [27]:
for col in cat_cols:
    tmp = pd.get_dummies(df[col], prefix=col)
    df = pd.concat([df, tmp], axis=1)

In [28]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize,Pclass_1,Pclass_2,Pclass_3,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0,0,0,1,0,1,0,1,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1,0,0,1,1,0,0,0,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0,0,1,0,0,1,0,1,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0,0,0,1,0,1,0,0,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,2,0,0,1,1,0,0,0,1

### Drop columns

In [29]:
drop_cols = ['PassengerId', 'Pclass', 'Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [30]:
df = df.drop(drop_cols, axis=1)
df.head()

,Age,SibSp,Parch,Fare,FamilySize,Pclass_1,Pclass_2,Pclass_3,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,34.5,0,0,7.8292,0,0,0,1,0,1,0,1,0
1,47.0,1,0,7.0000,1,0,0,1,1,0,0,0,1
2,62.0,0,0,9.6875,0,0,1,0,0,1,0,1,0
3,27.0,0,0,8.6625,0,0,0,1,0,1,0,0,1
4,22.0,1,1,12.2875,2,0,0,1,1,0,0,0,1

In [31]:
df.columns

Index(['Age', 'SibSp', 'Parch', 'Fare', 'FamilySize', 'Pclass_1', 'Pclass_2',
       'Pclass_3', 'Sex_female', 'Sex_male', 'Embarked_C', 'Embarked_Q',
       'Embarked_S'],
      dtype='object')

In [32]:
Column_order = ['Age', 'SibSp', 'Parch', 'Fare', 'FamilySize',
       'Pclass_1', 'Pclass_2', 'Pclass_3', 'Sex_female', 'Sex_male',
       'Embarked_C', 'Embarked_Q', 'Embarked_S']

In [33]:
output_file = file_folder + 'test_processed.csv'
df.to_csv(output_file, index=False)